Reports/ОтчетОплатыПоУслугам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Report>
		<Properties>
			<Name>ОтчетОплатыПоУслугам</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

AccumulationRegisters/РасчетыПоЛицевымСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>РасчетыПоЛицевымСчетам</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Тариф</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДнейНачислено</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Количество</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисления</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидТарифа</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыТарифов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтимулирующийТариф</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Порог</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ПорогиТарифовУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗначениеПорога</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидНачисленияПерерасчет</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыНачислений</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Услуги</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипДенежныхСредств</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыДенежныхСредств</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>БанковскийСчетКасса</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Кассы</v8:Type>
						<v8:Type>cfg:CatalogRef.БанковскиеСчета</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ДоговорРеструктуризацииДолга.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ДоговорРеструктуризацииДолга</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.ПлатежиПоРеструктуризацииДолга</xr:Item>
				<xr:Item>InformationRegister.НазначенныеУслуги</xr:Item>
				<xr:Item>InformationRegister.СостояниеРеструктуризацииДолга</xr:Item>
				<xr:Item>AccumulationRegister.РасчетыПоЛицевымСчетам</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Здание</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗданияИСооружения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЛицевойСчет</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЛицевыеСчета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаРассрочки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаЗавершенияРассрочки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДолга</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийДоговораРеструктуризацииДолга</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйВладелец</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПотребителиУслуг</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>СтруктураДолга</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>МесяцНачисления</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаПлатежа</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Reports/ОтчетОплатыПоУслугам/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура СформироватьОтчетНаСервере(ТабличныйДокумент)
	тзЛицевыеСчета = ЛицевыеСчетаПоОплате();
	
	ТаблицаРасчетыПоЛицевымСчетам = Новый ТаблицаЗначений;
	ТаблицаРасчетыПоЛицевымСчетам.Колонки.Добавить("ВидДвижения");
	ТаблицаРасчетыПоЛицевымСчетам.Колонки.Добавить("Период");
	ТаблицаРасчетыПоЛицевымСчетам.Колонки.Добавить("Организация");
	ТаблицаРасчетыПоЛицевымСчетам.Колонки.Добавить("ЛицевойСчет");
	ТаблицаРасчетыПоЛицевымСчетам.Колонки.Добавить("Услуга");
	ТаблицаРасчетыПоЛицевымСчетам.Колонки.Добавить("МесяцНачисления");
	ТаблицаРасчетыПоЛицевымСчетам.Колонки.Добавить("Сумма");
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток,
		|	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет,
		|	РасчетыПоЛицевымСчетамОстатки.Организация,
		|	РасчетыПоЛицевымСчетамОстатки.Услуга
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И ЛицевойСчет В (&ЛицевойСчет)
		|				И Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)
		|				И Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)
		|				И МесяцНачисления = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК РасчетыПоЛицевымСчетамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток,
		|	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет,
		|	РасчетыПоЛицевымСчетамОстатки.Организация,
		|	РасчетыПоЛицевымСчетамОстатки.Услуга
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И ЛицевойСчет В (&ЛицевойСчет)
		|				И Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)
		|				И МесяцНачисления = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)) КАК РасчетыПоЛицевымСчетамОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыПоЛицевымСчетамОстатки.Организация,
		|	РасчетыПоЛицевымСчетамОстатки.ЛицевойСчет КАК ЛицевойСчет,
		|	РасчетыПоЛицевымСчетамОстатки.Услуга КАК Услуга,
		|	РасчетыПоЛицевымСчетамОстатки.МесяцНачисления КАК МесяцНачисления,
		|	РасчетыПоЛицевымСчетамОстатки.СуммаОстаток
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам.Остатки(
		|			&Период,
		|			Организация = &Организация
		|				И ЛицевойСчет В (&ЛицевойСчет)
		|				И Услуга <> ЗНАЧЕНИЕ(Справочник.Услуги.ПустаяСсылка)
		|				И ВЫБОР
		|					КОГДА Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)
		|						ТОГДА МесяцНачисления = ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|					ИНАЧЕ МесяцНачисления <> ДАТАВРЕМЯ(1, 1, 1, 0, 0, 0)
		|				КОНЕЦ
		|				И НЕ Услуга.НеВключатьВРаспределение) КАК РасчетыПоЛицевымСчетамОстатки
		|
		|УПОРЯДОЧИТЬ ПО
		|	ЛицевойСчет,
		|	МесяцНачисления,
		|	РасчетыПоЛицевымСчетамОстатки.Услуга.ПолеСортировки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	РасчетыПоЛицевымСчетам.Регистратор,
		|	РасчетыПоЛицевымСчетам.Организация,
		|	РасчетыПоЛицевымСчетам.ЛицевойСчет,
		|	РасчетыПоЛицевымСчетам.Услуга,
		|	РасчетыПоЛицевымСчетам.Период,
		|	РасчетыПоЛицевымСчетам.Сумма,
		|	РасчетыПоЛицевымСчетам.ВидДвижения
		|ИЗ
		|	РегистрНакопления.РасчетыПоЛицевымСчетам КАК РасчетыПоЛицевымСчетам
		|ГДЕ
		|	РасчетыПоЛицевымСчетам.Период МЕЖДУ НАЧАЛОПЕРИОДА(&Дата, МЕСЯЦ) И КОНЕЦПЕРИОДА(&Дата, МЕСЯЦ)
		|	И ТИПЗНАЧЕНИЯ(РасчетыПоЛицевымСчетам.Регистратор) = ТИП(Документ.ДоговорРеструктуризацииДолга)
		|	И РасчетыПоЛицевымСчетам.Услуга = ЗНАЧЕНИЕ(Справочник.Услуги.РеструктуризацияДолга)
		|	И РасчетыПоЛицевымСчетам.ВидДвижения = ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ДенежныеСредства.Организация,
		|	ДенежныеСредства.Регистратор.ЛицевойСчет КАК ЛицевойСчет,
		|	ДенежныеСредства.Сумма
		|ИЗ
		|	РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
		|ГДЕ
		|	ДенежныеСредства.Период МЕЖДУ &ДатаНачала И &ДатаОкончания";
		
		
	Запрос.УстановитьПараметр("Период", Новый Граница(Отчет.Период.ДатаОкончания, ВидГраницы.Включая));
	Запрос.УстановитьПараметр("Организация", Отчет.Организация);
	Запрос.УстановитьПараметр("ЛицевойСчет", тзЛицевыеСчета);
	Запрос.УстановитьПараметр("Дата", Отчет.Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ДатаНачала", Отчет.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Отчет.Период.ДатаОкончания);

	
	РезультатЗапроса = Запрос.ВыполнитьПакет();
	
	ТаблицаАвансыУслуги = РезультатЗапроса[0].Выгрузить();
	ТаблицаАвансы = РезультатЗапроса[1].Выгрузить();
	ТаблицаДолги = РезультатЗапроса[2].Выгрузить();
	ТаблицаРеструктуризаций = РезультатЗапроса[3].Выгрузить();
	ТаблицаОплат = РезультатЗапроса[4].Выгрузить();
	
	Для Каждого СтрокаОплаты Из ТаблицаОплат Цикл
		СуммаОсталосьРаспределить = СтрокаОплаты.Сумма;
		ВыборкаДолги = ТаблицаДолги.НайтиСтроки(Новый Структура("ЛицевойСчет", СтрокаОплаты.ЛицевойСчет));
		Для каждого СтрокаВыборки Из ВыборкаДолги Цикл
			
			Если СтрокаВыборки.СуммаОстаток <= 0 тогда
				Продолжить;
			КонецЕсли;
			
			Если СтрокаВыборки.Услуга = Справочники.Услуги.РеструктуризацияДолга И СтрокаВыборки.СуммаОстаток >= СуммаОсталосьРаспределить тогда
				СтрокаПоиска = ТаблицаРеструктуризаций.НАйти(СтрокаВыборки.ЛицевойСчет, "ЛицевойСчет");
				Если СтрокаПоиска <> Неопределено ТОгда
					Продолжить;
				КонецЕсли;
			КонецЕсли;	
			
			
			
			Если СтрокаВыборки.СуммаОстаток <= СуммаОсталосьРаспределить Тогда // сумма остатка меньше или равна чем осталось распределить
				
				Сумма = СтрокаВыборки.СуммаОстаток;
				СуммаОсталосьРаспределить = СуммаОсталосьРаспределить - СтрокаВыборки.СуммаОстаток;
				
			Иначе // сумма остатка больше чем нужно распределить
				
				Сумма =	СуммаОсталосьРаспределить;
				СуммаОсталосьРаспределить = 0;
				
			КонецЕсли;
			
			НоваяСтрока = ТаблицаРасчетыПоЛицевымСчетам.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаВыборки); 
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяСтрока.Период = Отчет.Период.ДатаНачала;
			НоваяСтрока.Сумма = Сумма;
		КонецЦикла;
	КонецЦикла;
	
	ТаблицаРасчетыПоЛицевымСчетам.Свернуть("Организация, Услуга", "Сумма");
	СуммаПоЛицевымСчетам = ТаблицаРасчетыПоЛицевымСчетам.Итог("Сумма");
	
	
	Макет = Отчеты.ОтчетОплатыПоУслугам.ПолучитьМакет("Макет");
	
	ОбластьШапка = Макет.ПолучитьОбласть("ОбластьШапка");
	ОбластьШапка.Параметры.ДатаОтчета = Отчет.Период.ДатаНачала;
	ОбластьШапка.Параметры.Организация = Отчет.Организация;
	ТабличныйДокумент.Вывести(ОбластьШапка);
	
	ОбластьШапкаТаблицы = Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабличныйДокумент.Вывести(ОбластьШапкаТаблицы);
	
	ОбластьДанные = Макет.ПолучитьОбласть("ОбластьДанные");
	
	
	
	тзУслуги = Новый ТаблицаЗначений;
	тзУслуги.Колонки.Добавить("Услуга");
	тзУслуги.Колонки.Добавить("Сумма");
	
	Для Каждого стр Из ТаблицаРасчетыПоЛицевымСчетам Цикл
		Водоснабжение = 0;
	    Водоотведение = 0;
		НовСтрока = тзУслуги.Добавить();
		Если стр.Услуга.ВидУслуги = Справочники.ВидыУслуг.Водоотведение Тогда
			Водоотведение = Водоотведение + стр.Сумма;
			НовСтрока.Услуга = "Водовідведення";
			НовСтрока.Сумма = Водоотведение;
		ИначеЕсли стр.Услуга.ВидУслуги = Справочники.ВидыУслуг.ХолоднаяВода Тогда
			Водоснабжение = Водоснабжение + стр.Сумма;
			НовСтрока.Услуга = "Водопостачання";
			НовСтрока.Сумма = Водоснабжение;
		Иначе
			НовСтрока.Услуга = стр.Услуга;
		    НовСтрока.Сумма = стр.Сумма;
		КонецЕсли;
	КонецЦикла;
	СуммаВсего = тзУслуги.Итог("Сумма");
	тзУслуги.Свернуть("Услуга", "Сумма");
	Если СуммаВсего < ТаблицаОплат.Итог("Сумма") Тогда
		 ОставшаясяСумма = ТаблицаОплат.Итог("Сумма") - СуммаВсего;
		 КвоКубов = ОставшаясяСумма / 28.5400;
		 НовСтрока = тзУслуги.Добавить();
		 НовСтрока.Услуга = "Водопостачання";
		 НовСтрока.Сумма = Число(Формат(КвоКубов * 12.096, "ЧЦ=15; ЧДЦ=2"));
		 НовСтрока = тзУслуги.Добавить();
		 НовСтрока.Услуга = "Водовідведення";
		 НовСтрока.Сумма = Число(Формат(ОставшаясяСумма - (КвоКубов * 12.096), "ЧЦ=15; ЧДЦ=2"));
		 тзУслуги.Свернуть("Услуга", "Сумма");
	КонецЕсли;
	
	Всего = 0;
	Для Каждого стр Из тзУслуги Цикл
	    ОбластьДанные.Параметры.Заполнить(стр);
		Всего = Всего + ОбластьДанные.Параметры.Сумма;
		ТабличныйДокумент.Вывести(ОбластьДанные);
	КонецЦикла;
	ОбластьПодвал = Макет.ПолучитьОбласть("ОбластьПодвал");
	ОбластьПодвал.Параметры.СуммаВсего = Всего;
	ТабличныйДокумент.Вывести(ОбластьПодвал);
КонецПроцедуры

//&НаСервере
//Процедура СформироватьОтчетНаСервере(ТабличныйДокумент)
//	Запрос = Новый Запрос;
//	Запрос.Текст =
//	    
//КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	ТабличныйДокумент = Результат;
	СформироватьОтчетНаСервере(ТабличныйДокумент);
	ТабличныйДокумент.Показать();
КонецПроцедуры

&НаСервере
Функция ЛицевыеСчетаПоОплате()
	сзЛицевыеСчета = Новый СписокЗначений;
	Запрос = Новый Запрос;
	Запрос.Текст =
	    "ВЫБРАТЬ
	    |	ДенежныеСредства.Период,
	    |	ДенежныеСредства.Регистратор.ЛицевойСчет КАК ЛицевойСчет,
	    |	ДенежныеСредства.Сумма
	    |ИЗ
	    |	РегистрНакопления.ДенежныеСредства КАК ДенежныеСредства
	    |ГДЕ
	    |	ДенежныеСредства.Период МЕЖДУ &ДатаНачала И &ДатаОкончания";
	Запрос.УстановитьПараметр("ДатаНачала", Отчет.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаОкончания", Отчет.Период.ДатаОкончания);
	
	тест = Запрос.Выполнить().Выгрузить();
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		сзЛицевыеСчета.Добавить(Выборка.ЛицевойСчет);
	КонецЦикла;
	Возврат сзЛицевыеСчета;
КонецФункции;
